Extensions/FortMonitorAPI_ТЛЭ/Catalogs/SDL_НастройкиФортМонитор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>SDL_НастройкиФортМонитор</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользоватьФортМонитор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУчетныеЗаписиСистемыМониторинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВнешниеСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнтервалЗагрузки</Name>
					<Comment>Загрузка данных регламентным заданием за указанное время (хранится в сек.)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьПробегРасход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьДопСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагрузитьКоординаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПояс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ЧасовойПоясБазы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.SDL_ЧасовыеПояса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_РаботаСHTTPСервисами</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетОдометраПоПробегуНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ИспользоватьУниверсальноеВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SDL_ПересчетПробегаПоОдометруНаВозврат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/FortMonitorAPI_ТЛЭ/Catalogs/SDL_НастройкиФортМонитор/Ext/ManagerModule.bsl
Функция ПолучитьНастройки()  Экспорт
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	SDL_НастройкиФортМонитор.Ссылка КАК Ссылка,
	|	SDL_НастройкиФортМонитор.ВерсияДанных КАК ВерсияДанных,
	|	SDL_НастройкиФортМонитор.ПометкаУдаления КАК ПометкаУдаления,
	|	SDL_НастройкиФортМонитор.Код КАК Код,
	|	SDL_НастройкиФортМонитор.Наименование КАК Наименование,
	|	SDL_НастройкиФортМонитор.ИспользоватьФортМонитор КАК ИспользоватьФортМонитор,
	|	SDL_НастройкиФортМонитор.УчетнаяЗапись КАК УчетнаяЗапись,
	|	SDL_НастройкиФортМонитор.СистемаМониторинга КАК СистемаМониторинга,
	|	SDL_НастройкиФортМонитор.ИнтервалЗагрузки КАК ИнтервалЗагрузки,
	|	SDL_НастройкиФортМонитор.ЗагрузитьПробегРасход КАК ЗагрузитьПробегРасход,
	|	SDL_НастройкиФортМонитор.ЗагрузитьДопСведения КАК ЗагрузитьДопСведения,
	|	SDL_НастройкиФортМонитор.ЗагрузитьКоординаты КАК ЗагрузитьКоординаты,
	|	SDL_НастройкиФортМонитор.SDL_ЧасовойПояс КАК SDL_ЧасовойПояс,
	|	SDL_НастройкиФортМонитор.SDL_ЧасовойПоясБазы КАК SDL_ЧасовойПоясБазы,
	|	SDL_НастройкиФортМонитор.SDL_РаботаСHTTPСервисами КАК SDL_РаботаСHTTPСервисами,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетОдометраПоПробегуНаВозврат КАК SDL_ПересчетОдометраПоПробегуНаВозврат,
	|	SDL_НастройкиФортМонитор.SDL_ИспользоватьУниверсальноеВремя КАК SDL_ИспользоватьУниверсальноеВремя,
	|	SDL_НастройкиФортМонитор.SDL_ПересчетПробегаПоОдометруНаВозврат КАК SDL_ПересчетПробегаПоОдометруНаВозврат,
	|	SDL_НастройкиФортМонитор.Предопределенный КАК Предопределенный,
	|	SDL_НастройкиФортМонитор.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	SDL_НастройкиФортМонитор.Представление КАК Представление
	|ИЗ
	|	Справочник.SDL_НастройкиФортМонитор КАК SDL_НастройкиФортМонитор";
	
	ТЗ = Запрос.Выполнить().Выгрузить(); 
	СтрокаТЗ = ТЗ[0]; 
	Если НЕ ТЗ.Количество() Тогда
		
		Возврат Неопределено;	
		
	КонецЕсли;
	СтруктураСтроки = Новый Структура;
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		СтруктураСтроки.Вставить(Колонка.Имя, СтрокаТЗ[Колонка.Имя]);
	КонецЦикла;
	
	Возврат СтруктураСтроки;	
	
КонецФункции
